In [1]:
import pandas as pd

In [3]:
df=pd.read_csv('titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [4]:
df.drop(['Name','PassengerId','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [6]:
inputs=df.drop('Survived',axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [7]:
target=df.Survived

In [10]:
dummies=pd.get_dummies(df.Sex)
inputs=pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [11]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [18]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [26]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())

In [28]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(inputs,target,test_size=0.2)

In [29]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [30]:
model.fit(X_train,y_train)

GaussianNB()

In [32]:
model.score(X_test,y_test)

0.776536312849162

In [33]:
X_test[:10]

     Pclass        Age     Fare  female
117       2  29.000000  21.0000       0
5         3  29.699118   8.4583       0
150       2  51.000000  12.5250       0
667       3  29.699118   7.7750       0
221       2  27.000000  13.0000       0
218       1  32.000000  76.2917       1
70        2  32.000000  10.5000       0
160       3  44.000000  16.1000       0
690       1  31.000000  57.0000       0
787       3   8.000000  29.1250       0

In [34]:
y_test[:10]

117    0
5      0
150    0
667    0
221    0
218    1
70     0
160    0
690    1
787    0
Name: Survived, dtype: int64

In [37]:
model.predict(X_test[:10])

array([0, 0, 0, 0, 0, 1, 0, 0, 0, 0], dtype=int64)

In [42]:
import numpy as np
from sklearn.model_selection import cross_val_score
sc=cross_val_score(GaussianNB(),X_train,y_train,cv=5)
np.average(sc)

0.773928888013395